if (true) then
{
	_triggers = [
	["Селакано",[20785.9,6712.67,0],[300, 300, 0]], // Массив триггеров в формате ["Название", [Координаты x, y, z],[Размеры по x, y, угол наклона]]
	["Ферес",[21678.6,7569.89,0],[300, 300, 0]],
	["Панагия",[20450.2,8887.12,0],[310, 310, 0]],
	["Экали",[17059.7,9992.37,0],[300, 300, 0]],
	["Халкея",[20194.6,11660.7,0],[300, 300, 0]],
	["Пиргос",[16820.6,12647.5,0],[350, 430, 0]],
	["Дорида",[19400.9,13300.3,0],[300, 300, 0]],
	["Харкия",[18114.1,15222.8,0], [540, 390, 0]],
	["Нифи",[19441.1,15378.7,0],[300, 300, 0]],
	["Калохори",[21369,16356,0],[300, 300, 0]],
	["Парос",[20947.6,16971.8,0],[360, 400, 0]],
	["Альмира",[23599.6,18401.1,0],[610, 620, 0]],
	["Иоаннина",[23199.7,19984.6, 0],[300, 300, 0]],
	["Дельфинаки",[23932.2,20169.4,0],[300, 300, 0]],
	["София",[25680.5,21365.1,0],[350, 350, 0]],
	["Аликампос",[11112.6,14573.7,0],[300, 300, 0]],
	["Тополия",[7390.81,15400.5,0],[300, 300, 0]],
	["Коре",[7095.42,16450.1,0],[300, 300, 0]],
	["Каталаки",[11745.1,13699.1,0],[300, 300, 40]],
	["Кавала",[3568.95,12940.4,0],[400, 320, 80]],
	["Аггелохори",[3795.78,13706.1,0],[300, 320, 0]],
	["Териса",[10618.9,12237.3,0],[300, 300, 0]],
	["Негадес",[4885.98,16171.3,0],[390, 350, 0]],
	["Полиакко",[10966.5,13435.3,0],[300, 300, 0]],
	["Лакка",[12402,15702.3,0],[300, 300, 0]],
	["Нери",[4116.11,11706.1,0],[300, 300, 0]],
	["Ставрос",[12950.1,15041.6,0],[300, 300, 0]],
	["Абдера",[9425.42,20284,0],[300, 300, 0]],
	["Фрини",[14612.5,20786.7,0],[300, 300, 0]],
	["Зарос",[9200.81,11900.9,0],[350, 550, -45]],
	["Неохори",[12502,14387,0],[300, 400, 70]],
	["Корони",[11786.7,18302.4,0],[300, 300, 0]],
	["Айос-Дионисиос",[9357.95,15887.8,0],[450, 300, -20]],
	["Айя-Триада",[16668.5,20477,0],[300, 300, 0]],
	["Панохори",[5083.31,11245.2,0],[350, 350, 0]],
	["Айос-Константинос",[3988.77,17407.8,0],[300, 350, -25]],
	["Орино",[10440.4,17273.1,0],[300, 300, 0]],
	["Ифестиона",[12837,19679.3,0],[300, 300, 0]],
	["Галати",[10330.3,19086,0],[35, 350, 0]],
	["Ореокастро",[4600.45,21430.6,0],[300, 300, 0]],
	["Калитея",[17906.5,18129.4,0],[300, 300, 0]],
	["Айос-Петрос",[19319.4,17641.6,0],[300, 300, 0]],
	["Сирта",[8625.13,18301.6,0],[300, 300, 0]],
	["Атира",[14053,18739.4,0],[300, 450, 45]],
	["Родополи",[18833.4,16597.1,0],[300, 300, 0]],
	["Штаб",[14722.4,16533.9,0],[500, 1200,40]],
	["Северо-Западный Аэродром",[9167.16,21525.8,0],[300, 350, 50]],
	["Аэродром аэроклуба",[11500,11700,0],[300, 400, 35]],
	["Юго-Восточный Аэродром",[21000,7347.22,0],[300, 450, 30]],
	["Пустынный Аэродром",[23147.9,18682.4,0],[300, 350, 0]],
	["Аэродром Молос",[26939.8,24743.8,0],[350, 250, -30]]
	];
	_randomTrigger = selectRandom _triggers;     // Выбираем рандомный триггер
	_randomTriggerName = _randomTrigger # 0;      // Берём название триггера
	_randomTriggerPosition = _randomTrigger # 1;      // Берём позицию триггера
	_randomTriggerParams = _randomTrigger # 2;    // Берём параметры триггера
	_markerOnMap = createMarker [_randomTriggerName, _randomTriggerPosition];      // Создаём маркер
	_markerOnMap setMarkerShape "ELLIPSE";      // Задаём форму маркера
	_markerOnMap setMarkerSize [_randomTriggerParams # 0, _randomTriggerParams # 1];       // Задаём размеры маркера
	_markerOnMap setMarkerDir _randomTriggerParams # 2;    // Задаём угол поворота маркера
	_triggerOnMap = createTrigger ["EmptyDetector", _randomTriggerPosition, true];       // Создаём триггер
	_triggerOnMap setTriggerArea [ (_randomTriggerParams # 0 / 2), (_randomTriggerParams # 1) / 2, _randomTriggerParams # 2, false,-1];		// Задаём размеры триггера
	_triggerOnMap setTriggerActivation ["ANYPLAYER", "PRESENT", true];       // Вид активации триггера (переделать)
	_trgCrewGroups = [ _randomTriggerPosition, _randomTriggerParams, _triggerOnMap ] spawn trg_fnc_spawnVehicles;   // Прописываем спавн техники, в коллбеке группы1
	_trgControlPoints = [ _randomTriggerPosition, _randomTriggerParams ] spawn trg_fnc_pointSpawn;   // Спавн КТ
	_trgPatrolGroups = [ _randomTriggerPosition, _randomTriggerParams, 20, _triggerOnMap ] spawn trg_fnc_patrolGroups;		// Спавн пехов
	_trgHouseGroups = [ _randomTriggerPosition, _randomTriggerParams ] spawn trg_fnc_inHouseSpawn;		// Спавн пехов в домах
	[ [_randomTrigger # 0, _randomTrigger # 1, _randomTriggerParams # 2], _triggerOnMap] spawn trg_fnc_spawnHeli;	// Спавн воздушного подкрепа
};
